Hybrid-Memcached-(with-aggre)/ex2_result/memtier_12t_16t_default_datasize_1970_cycle_100_result
16        Threads
50        Connections per thread
120       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        17843.18          ---          ---        44.65039        40.44700        78.84700       119.29500     35076.49 
Gets           13.33        13.33         0.00        39.33652        39.16700        55.03900        81.40700        26.48 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      17856.51        13.33         0.00        44.64642        40.44700        78.84700       119.29500     35102.97 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.895        0.000
SET      37.375        5.000
SET      38.143       10.000
SET      38.655       15.000
SET      38.911       20.000
SET      39.167       25.000
SET      39.423       30.000
SET      39.679       35.000
SET      39.935       40.000
SET      40.191       45.000
SET      40.447       50.000
SET      40.703       52.500
SET      40.959       55.000
SET      40.959       57.500
SET      41.215       60.000
SET      41.471       62.500
SET      41.727       65.000
SET      42.239       67.500
SET      43.007       70.000
SET      44.543       72.500
SET      48.383       75.000
SET      50.943       76.250
SET      52.735       77.500
SET      53.759       78.750
SET      54.527       80.000
SET      55.039       81.250
SET      55.807       82.500
SET      56.319       83.750
SET      56.831       85.000
SET      57.343       86.250
SET      57.855       87.500
SET      58.111       88.125
SET      58.367       88.750
SET      58.623       89.375
SET      58.879       90.000
SET      59.135       90.625
SET      59.391       91.250
SET      59.647       91.875
SET      59.903       92.500
SET      60.159       93.125
SET      60.415       93.750
SET      60.415       94.062
SET      60.671       94.375
SET      60.671       94.688
SET      60.927       95.000
SET      61.183       95.312
SET      61.183       95.625
SET      61.439       95.938
SET      61.695       96.250
SET      61.951       96.562
SET      62.207       96.875
SET      62.207       97.031
SET      62.463       97.188
SET      62.719       97.344
SET      62.975       97.500
SET      63.231       97.656
SET      63.743       97.812
SET      64.255       97.969
SET      65.023       98.125
SET      66.047       98.281
SET      68.095       98.438
SET      69.631       98.516
SET      72.191       98.594
SET      75.263       98.672
SET      76.799       98.750
SET      77.311       98.828
SET      78.335       98.906
SET      78.847       98.984
SET      79.359       99.062
SET      79.871       99.141
SET      80.383       99.219
SET      80.383       99.258
SET      80.895       99.297
SET      81.407       99.336
SET      81.407       99.375
SET      81.919       99.414
SET      82.431       99.453
SET      83.455       99.492
SET      84.479       99.531
SET      86.527       99.570
SET      90.623       99.609
SET      93.695       99.629
SET      98.815       99.648
SET     102.399       99.668
SET     105.471       99.688
SET     107.519       99.707
SET     109.055       99.727
SET     110.591       99.746
SET     111.615       99.766
SET     113.151       99.785
SET     114.175       99.805
SET     114.687       99.814
SET     115.199       99.824
SET     115.711       99.834
SET     116.223       99.844
SET     116.735       99.854
SET     117.247       99.863
SET     118.271       99.873
SET     118.783       99.883
SET     119.295       99.893
SET     119.807       99.902
SET     119.807       99.907
SET     120.319       99.912
SET     120.319       99.917
SET     120.831       99.922
SET     121.343       99.927
SET     121.343       99.932
SET     121.855       99.937
SET     122.367       99.941
SET     122.879       99.946
SET     123.391       99.951
SET     123.903       99.954
SET     124.415       99.956
SET     124.927       99.958
SET     125.439       99.961
SET     125.951       99.963
SET     126.463       99.966
SET     127.999       99.968
SET     133.119       99.971
SET     137.215       99.973
SET     151.551       99.976
SET     159.743       99.977
SET     165.887       99.978
SET     172.031       99.979
SET     177.151       99.980
SET     183.295       99.982
SET     193.535       99.983
SET     204.799       99.984
SET     242.687       99.985
SET     288.767       99.987
SET     358.399       99.988
SET     389.119       99.988
SET     413.695       99.989
SET     438.271       99.990
SET     464.895       99.990
SET     491.519       99.991
SET     528.383       99.991
SET     561.151       99.992
SET     593.919       99.993
SET     626.687       99.993
SET     659.455       99.994
SET     679.935       99.994
SET     696.319       99.995
SET     708.607       99.995
SET     729.087       99.995
SET     745.471       99.995
SET     770.047       99.996
SET     782.335       99.996
SET     806.911       99.996
SET     823.295       99.997
SET     843.775       99.997
SET     851.967       99.997
SET     868.351       99.997
SET     888.831       99.997
SET     888.831       99.998
SET     897.023       99.998
SET     909.311       99.998
SET     921.599       99.998
SET     929.791       99.998
SET     937.983       99.998
SET     954.367       99.998
SET     958.463       99.999
SET     962.559       99.999
SET     970.751       99.999
SET     970.751       99.999
SET     974.847       99.999
SET     978.943       99.999
SET     983.039       99.999
SET     995.327       99.999
SET     999.423       99.999
SET    1007.615       99.999
SET    1007.615       99.999
SET    1007.615       99.999
SET    1011.711       99.999
SET    1011.711       99.999
SET    1015.807       99.999
SET    1015.807       99.999
SET    1015.807      100.000
SET    1023.999      100.000
SET    1028.095      100.000
SET    1028.095      100.000
SET    1028.095      100.000
[...]
SET    1032.191      100.000
SET    1032.191      100.000
SET    1032.191      100.000
SET    1036.287      100.000
SET    1036.287      100.000
SET    1044.479      100.000
SET    1044.479      100.000
SET    1044.479      100.000
[...]
SET    1048.575      100.000
SET    1048.575      100.000
---
GET      23.807        0.000
GET      34.559        5.000
GET      36.095       10.000
GET      36.863       15.000
GET      37.375       20.000
GET      37.887       25.000
GET      38.143       30.000
GET      38.399       35.000
GET      38.911       40.000
GET      38.911       45.000
GET      39.167       50.000
GET      39.423       52.500
GET      39.423       55.000
GET      39.679       57.500
GET      39.679       60.000
GET      39.935       62.500
GET      39.935       65.000
GET      40.191       67.500
GET      40.191       70.000
GET      40.447       72.500
GET      40.447       75.000
GET      40.447       76.250
GET      40.703       77.500
GET      40.703       78.750
GET      40.703       80.000
GET      40.959       81.250
GET      40.959       82.500
GET      40.959       83.750
GET      41.215       85.000
GET      41.215       86.250
GET      41.471       87.500
GET      41.471       88.125
GET      41.471       88.750
GET      41.727       89.375
GET      41.727       90.000
GET      41.983       90.625
GET      41.983       91.250
GET      42.239       91.875
GET      42.239       92.500
GET      42.495       93.125
GET      42.495       93.750
GET      42.751       94.062
GET      42.751       94.375
GET      43.007       94.688
GET      43.007       95.000
GET      43.519       95.312
GET      43.519       95.625
GET      44.031       95.938
GET      44.287       96.250
GET      44.799       96.562
GET      45.055       96.875
GET      45.311       97.031
GET      45.311       97.188
GET      45.567       97.344
GET      45.823       97.500
GET      45.823       97.656
GET      46.079       97.812
GET      46.335       97.969
GET      46.591       98.125
GET      47.359       98.281
GET      47.615       98.438
GET      48.127       98.516
GET      48.383       98.594
GET      48.639       98.672
GET      49.407       98.750
GET      50.943       98.828
GET      55.039       98.906
GET      55.039       98.984
GET      55.807       99.062
GET      75.263       99.141
GET      75.263       99.219
GET      75.775       99.258
GET      75.775       99.297
GET      77.311       99.336
GET      77.311       99.375
GET      78.847       99.414
GET      79.359       99.453
GET      79.359       99.492
GET      79.871       99.531
GET      79.871       99.570
GET      79.871       99.609
GET      80.383       99.629
GET      80.383       99.648
GET      80.383       99.668
GET      80.383       99.688
GET      80.383       99.707
GET      80.383       99.727
GET      80.383       99.746
GET      80.383       99.766
GET      80.383       99.785
GET      80.383       99.805
GET      81.407       99.814
GET      81.407       99.824
GET      81.407       99.834
GET      81.407       99.844
GET      81.407       99.854
GET      81.407       99.863
GET      81.407       99.873
GET      82.431       99.883
GET      82.431       99.893
GET      82.431       99.902
GET      82.431       99.907
GET      82.431       99.912
GET      82.431       99.917
GET      82.431       99.922
GET      82.431       99.927
GET      82.431       99.932
GET      82.431       99.937
GET      83.455       99.941
GET      83.455      100.000
---
WAIT      0.000      100.000